## Basic Python Commands

In [7]:
import pandas as p

In [9]:
x = p.read_csv('http://rcs.bu.edu/examples/python/data_analysis/Salaries.csv')

In [5]:
x.head()
x.head(10)

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285
7       Prof          A   18       18  Male  126300
8       Prof          A   29       19  Male   94350
9       Prof          A   51       51  Male   57800

In [10]:
x.tail()

         rank discipline  phd  service     sex  salary
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [7]:
x.tail(10)

         rank discipline  phd  service     sex  salary
68   AsstProf          A    4        2  Female   77500
69       Prof          A   28        7  Female  116450
70   AsstProf          A    8        3  Female   78500
71  AssocProf          B   12        9  Female   71065
72       Prof          B   24       15  Female  161101
73       Prof          B   18       10  Female  105450
74  AssocProf          B   19        6  Female  104542
75       Prof          B   17       17  Female  124312
76       Prof          A   28       14  Female  109954
77       Prof          A   23       15  Female  109646

In [9]:
x.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [11]:
x.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [18]:
x.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [20]:
x.max()

rank            Prof
discipline         B
phd               56
service           51
sex             Male
salary        186960
dtype: object

In [21]:
x.phd.max()

56

In [22]:
x.min()

rank          AssocProf
discipline            A
phd                   1
service               0
sex              Female
salary            57800
dtype: object

In [23]:
x.mean()

phd            19.705128
service        15.051282
salary     108023.782051
dtype: float64

In [24]:
x.discipline.value_counts()

B    42
A    36
Name: discipline, dtype: int64

In [11]:
x.std()

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [12]:
x.phd.std()

12.498424809175866

In [ ]:
x_50 = x.head(50)
x_50.mean()

In [40]:
x.head(50).mean()

phd            21.52
service        17.60
salary     113789.14
dtype: float64

In [41]:
x.phd

0     56
1     12
2     23
3     40
4     20
      ..
73    18
74    19
75    17
76    28
77    23
Name: phd, Length: 78, dtype: int64

In [42]:
x['phd']

0     56
1     12
2     23
3     40
4     20
      ..
73    18
74    19
75    17
76    28
77    23
Name: phd, Length: 78, dtype: int64

In [46]:
x[['phd']]

    phd
0    56
1    12
2    23
3    40
4    20
..  ...
73   18
74   19
75   17
76   28
77   23

[78 rows x 1 columns]

In [44]:
x.phd.describe ()

count    78.000000
mean     19.705128
std      12.498425
min       1.000000
25%      10.250000
50%      18.500000
75%      27.750000
max      56.000000
Name: phd, dtype: float64

In [56]:
x.groupby('rank')['service','salary'].mean()

             service         salary
rank
AssocProf  11.307692   91786.230769
AsstProf    2.210526   81362.789474
Prof       21.413043  123624.804348

In [65]:
x[x.service>30][['rank','discipline','sex']]

    rank discipline     sex
0   Prof          B    Male
3   Prof          A    Male
9   Prof          A    Male
10  Prof          B    Male
13  Prof          B    Male
25  Prof          B    Male
27  Prof          A    Male
36  Prof          B    Male
40  Prof          A  Female

In [76]:
x.iloc[0:4,0:4]

   rank discipline  phd  service
0  Prof          B   56       49
1  Prof          A   12        6
2  Prof          A   23       20
3  Prof          A   40       31

In [78]:
x.iloc[:,5]

0     186960
1      93000
2     110515
3     131205
4     104800
       ...
73    105450
74    104542
75    124312
76    109954
77    109646
Name: salary, Length: 78, dtype: int64

In [81]:
x.iloc[3,:]

rank            Prof
discipline         A
phd               40
service           31
sex             Male
salary        131205
Name: 3, dtype: object